client/results/rq2/h1/stresstest/client_8/summary.txt
starting benchmark...
spawning thread #0: 4 total client(s). 25000 total requests
spawning thread #1: 4 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 13.15s, 3801.37 req/s, 16.67MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      405us     25.93ms      2.07ms      1.18ms    82.29%
time for connect:    18.39ms     20.47ms     19.46ms       833us    37.50%
time to 1st byte:    36.98ms     44.30ms     41.73ms      2.26ms    75.00%
req/s           :     475.29      486.48      480.72        3.69    75.00%