client/results/rq2/h1/stresstest/client_8/summary.txt
starting benchmark...
spawning thread #0: 4 total client(s). 25000 total requests
spawning thread #1: 4 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 15.79s, 3165.99 req/s, 13.88MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      395us     24.38ms      2.40ms      1.11ms    76.37%
time for connect:     6.33ms     17.24ms     12.76ms      4.34ms    50.00%
time to 1st byte:    13.37ms     27.34ms     20.53ms      4.40ms    62.50%
req/s           :     395.77      425.96      415.92       12.18    75.00%